In [ ]:
##Creating, Reading and Writing

In [27]:
import pandas as pd

# Read the CSV file
dataframe = pd.read_csv('csv/us-counties-2023.csv')

# Display the first few rows
print(dataframe)

              date      county    state     fips  cases  deaths
0       2023-01-01     Autauga  Alabama   1001.0  18961   230.0
1       2023-01-01     Baldwin  Alabama   1003.0  67496   719.0
2       2023-01-01     Barbour  Alabama   1005.0   7027   111.0
3       2023-01-01        Bibb  Alabama   1007.0   7692   108.0
4       2023-01-01      Blount  Alabama   1009.0  17731   260.0
...            ...         ...      ...      ...    ...     ...
267004  2023-03-23  Sweetwater  Wyoming  56037.0  12519   139.0
267005  2023-03-23       Teton  Wyoming  56039.0  12150    16.0
267006  2023-03-23       Uinta  Wyoming  56041.0   6416    43.0
267007  2023-03-23    Washakie  Wyoming  56043.0   2700    51.0
267008  2023-03-23      Weston  Wyoming  56045.0   1906    23.0

[267009 rows x 6 columns]

In [22]:
import pandas as pd

In [23]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [24]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [25]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [26]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [28]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [29]:
wine_reviews = pd.read_csv("csv/us-counties-2023.csv")

In [30]:
wine_reviews.shape

(267009, 6)

In [31]:
wine_reviews.head()

         date   county    state    fips  cases  deaths
0  2023-01-01  Autauga  Alabama  1001.0  18961   230.0
1  2023-01-01  Baldwin  Alabama  1003.0  67496   719.0
2  2023-01-01  Barbour  Alabama  1005.0   7027   111.0
3  2023-01-01     Bibb  Alabama  1007.0   7692   108.0
4  2023-01-01   Blount  Alabama  1009.0  17731   260.0

In [32]:
wine_reviews = pd.read_csv("csv/us-counties-2023.csv", index_col=0)
wine_reviews.head()

             county    state    fips  cases  deaths
date
2023-01-01  Autauga  Alabama  1001.0  18961   230.0
2023-01-01  Baldwin  Alabama  1003.0  67496   719.0
2023-01-01  Barbour  Alabama  1005.0   7027   111.0
2023-01-01     Bibb  Alabama  1007.0   7692   108.0
2023-01-01   Blount  Alabama  1009.0  17731   260.0

In [ ]:
#Indexing, Selecting & Assigning

In [42]:
import pandas as pd

reviews = pd.read_csv('csv/us-counties-2023.csv')

print(reviews['county'])

0            Autauga
1            Baldwin
2            Barbour
3               Bibb
4             Blount
             ...
267004    Sweetwater
267005         Teton
267006         Uinta
267007      Washakie
267008        Weston
Name: county, Length: 267009, dtype: object

In [48]:
reviews.iloc[0]

date      2023-01-01
county       Autauga
state        Alabama
fips          1001.0
cases          18961
deaths         230.0
Name: 0, dtype: object

In [49]:
reviews.iloc[:, 0]

0         2023-01-01
1         2023-01-01
2         2023-01-01
3         2023-01-01
4         2023-01-01
             ...
267004    2023-03-23
267005    2023-03-23
267006    2023-03-23
267007    2023-03-23
267008    2023-03-23
Name: date, Length: 267009, dtype: object

In [50]:
reviews.iloc[-5:]

              date      county    state     fips  cases  deaths
267004  2023-03-23  Sweetwater  Wyoming  56037.0  12519   139.0
267005  2023-03-23       Teton  Wyoming  56039.0  12150    16.0
267006  2023-03-23       Uinta  Wyoming  56041.0   6416    43.0
267007  2023-03-23    Washakie  Wyoming  56043.0   2700    51.0
267008  2023-03-23      Weston  Wyoming  56045.0   1906    23.0

In [51]:
    reviews.loc[0, 'county']

'Autauga'

In [57]:
#

In [55]:
reviews.county == 'Weston'

0         False
1         False
2         False
3         False
4         False
          ...
267004    False
267005    False
267006    False
267007    False
267008     True
Name: county, Length: 267009, dtype: bool

In [59]:
#Summary Functions and Maps

In [58]:
reviews.deaths.mean()

np.float64(352.2099242938764)

In [60]:
reviews.deaths.describe()

count    260613.000000
mean        352.209924
std        1322.158230
min           0.000000
25%          48.000000
50%         111.000000
75%         262.000000
max       45155.000000
Name: deaths, dtype: float64

In [61]:
reviews.head(1)

         date   county    state    fips  cases  deaths
0  2023-01-01  Autauga  Alabama  1001.0  18961   230.0

In [62]:
#Grouping and Sorting

In [63]:
reviews.groupby('deaths').deaths.count()

deaths
0.0        2976
1.0        1124
2.0        1132
3.0         820
4.0        1000
           ...
45043.0       2
45074.0       1
45076.0       3
45123.0       1
45155.0       1
Name: deaths, Length: 3062, dtype: int64

In [64]:
reviews.groupby('deaths').cases.min()

deaths
0.0              1
1.0              0
2.0            101
3.0              0
4.0             76
            ...
45043.0    3236362
45074.0    3237762
45076.0    3238686
45123.0    3252967
45155.0    3252357
Name: cases, Length: 3062, dtype: int64

In [65]:
reviews.groupby(['county']).fips.agg([len, min, max])

C:\Users\RAMANA JSRA\AppData\Local\Temp\ipykernel_2392\790293109.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  reviews.groupby(['county']).fips.agg([len, min, max])
C:\Users\RAMANA JSRA\AppData\Local\Temp\ipykernel_2392\790293109.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  reviews.groupby(['county']).fips.agg([len, min, max])

                           len      min      max
county
Abbeville                   82  45001.0  45001.0
Acadia                      82  22001.0  22001.0
Accomack                    82  51001.0  51001.0
Ada                         82  16001.0  16001.0
Adair                      328  19001.0  40001.0
...                        ...      ...      ...
Yukon-Koyukuk Census Area   82   2290.0   2290.0
Yuma                       164   4027.0   8125.0
Zapata                      82  48505.0  48505.0
Zavala                      82  48507.0  48507.0
Ziebach                     82  46137.0  46137.0

[1932 rows x 3 columns]

In [ ]:
#Data Types and Missing Values